app/controllers/transfers_controller.rb

SELECT "transfers".* FROM "transfers" ORDER BY "transfers"."created_at" DESC
---
  def index
    @transfers = Transfer.all.order(created_at: :desc)

SELECT "users".* FROM "users" ORDER BY "users"."nickname" ASC
---
  def edit
    @users = User.all.order(:nickname)

INSERT INTO "transfers" ("amount", "created_at", "updated_at", "status", "sender_id", "receiver_id") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 200.0], ["created_at", "2025-12-06 22:50:18.774005"], ["updated_at", "2025-12-06 22:50:18.774005"], ["status", "pending"], ["sender_id", 2], ["receiver_id", 1]]
---
  def create
    @transfer = Transfer.new(transfer_params)
    @transfer.sender = current_user

    respond_to do |format|
      if @transfer.save

UPDATE "transfers" SET "updated_at" = ?, "status" = ? WHERE "transfers"."id" = ?  [["updated_at", "2025-12-06 22:51:08.563568"], ["status", "completed"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @transfer.update(transfer_params)

DELETE FROM "transfers" WHERE "transfers"."id" = ?  [["id", 2]]
---
  def destroy
    @transfer.destroy

UPDATE "transfers" SET "updated_at" = ?, "status" = ? WHERE "transfers"."id" = ?  [["updated_at", "2025-12-06 22:36:06.605857"], ["status", "completed"], ["id", 3]]
---
  def complete
    if @transfer.pending? && @transfer.update(status: 'completed')

SELECT "transfers".* FROM "transfers" WHERE "transfers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_transfer
      @transfer = Transfer.find(params[:id])